#### MacroEnvironment Enumeration

---

|  |
| --- |
| See Also |

The Macro environments.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public enum MacroEnvironment ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration MacroEnvironment ``` |

| Visual C++ |
| --- |
| ``` public enum class MacroEnvironment ``` |

# Members

| Member name | Description |
| --- | --- |
| DB | The DB environment. |
| UI | The UI environment. |

# See Also

Autodesk.Revit.DB.Macros Namespace